# Введення значень a, b, c, x
a = float(input("Введіть значення a: "))
b = float(input("Введіть значення b: "))
c = float(input("Введіть значення c: "))
x = float(input("Введіть значення x: "))

# Спосіб 1: Розгалуження в скороченій формі
if x < 0 and b != 0:
    F1 = -(2 * x - c) / (b * x - a)
elif x > 0 and b == 0:
    F1 = (x - a) / (x - c)
else:
    F1 = -x / c + (-c) / (2 * x + 1)

print("\n1) Значення F (скорочена форма):", F1)

# Спосіб 2: Розгалуження в повній формі
if x < 0 and b != 0:
    F2 = -(2 * x - c) / (b * x - a)
else:
    if x > 0 and b == 0:
        F2 = (x - a) / (x - c)
    else:
        F2 = -x / c + (-c) / (2 * x + 1)

print("2) Значення F (повна форма):", F2)
